In [12]:
# Importing pandas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import numpy as np

attrition = pd.read_feather("../datasets/attrition.feather")
spotify = pd.read_feather("../datasets/spotify_2000_2020.feather")
coffee_ratings = pd.read_feather("../datasets/coffee_ratings_full.feather")

In [4]:
import pandas as pd

In [5]:
###############
x=[i for i in range(100)]
t =pd.DataFrame({})

In [6]:
t['x']=x

In [7]:
t.sample(20)

     x
82  82
7    7
65  65
75  75
0    0
56  56
79  79
88  88
58  58
20  20
3    3
55  55
27  27
45  45
67  67
31  31
59  59
8    8
70  70
53  53

In [8]:
t.sample(frac=0.2)

     x
63  63
75  75
49  49
67  67
98  98
1    1
36  36
96  96
80  80
95  95
20  20
7    7
87  87
62  62
37  37
41  41
53  53
45  45
3    3
99  99

In [9]:
t.sample(frac=0.02)

     x
98  98
23  23

In [10]:
q1 =filter(lambda i: i%5 ==0 ,t['x'])
list(q1)

[0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]

In [11]:
q2= filter(lambda i:i>50 and i%2 ==0 , t.x)
list(q2)

[52,
 54,
 56,
 58,
 60,
 62,
 64,
 66,
 68,
 70,
 72,
 74,
 76,
 78,
 80,
 82,
 84,
 86,
 88,
 90,
 92,
 94,
 96,
 98]

In [13]:
# Sample one to eight, five times, with replacement
five_rolls = np.random.choice(list(range(1, 9)), size=5, replace=True)

# Print the mean of five_rolls
print(five_rolls.mean())

5.8

In [19]:
# Sample one to eight, five times, with replacement
five_rolls = np.random.choice(range(1, 9) ,  size=2)

# Print the mean of five_rolls
print(five_rolls.mean())

5.0